Resources/canonical_library/wsdl/Create.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:p1="http://test.sap.com/ZUDI" xmlns:p2="https://services.ird.govt.nz/GWS/Employment/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="Create" soap:location="http://www.example.org/" targetNamespace="http://test.sap.com/ZUDI" wsdlsoap:location="http://www.example.org/"><wsdl:documentation/><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="OP_Create"/><wsdl:types><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/" xmlns:q1="https://services.ird.govt.nz/GWS/Employment/:types/CreateRequest" xmlns:q2="https://services.ird.govt.nz/GWS/Employment/:types/CreateResponse" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/"><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/CreateRequest"/><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/CreateResponse"/><xsd:element name="Create"><xsd:complexType><xsd:sequence><xsd:element form="qualified" name="CreateRequestMsg" nillable="true" type="q1:CreateRequestType"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="CreateResponse"><xsd:complexType><xsd:sequence><xsd:element form="qualified" minOccurs="0" name="CreateResult" nillable="true" type="q2:CreateResponseType"/></xsd:sequence></xsd:complexType></xsd:element></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/CreateResponse" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/CreateResponse"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="CreateResponseType"><xsd:sequence><xsd:element form="qualified" name="CreateResponseWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:employmentResponse"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/CreateRequest" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/CreateRequest"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="CreateRequestType"><xsd:sequence><xsd:element form="qualified" name="CreateRequestWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:createRequest"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="p2.Employment_Create_InputMessage"><wsdl:documentation/><wsdl:part element="p2:Create" name="parameters"/></wsdl:message><wsdl:message name="p2.Employment_Create_OutputMessage"><wsdl:documentation/><wsdl:part element="p2:CreateResponse" name="parameters"/></wsdl:message><wsdl:portType name="Create"><wsdl:documentation/><wsdl:operation name="Create"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference URI="#OP_Create"/></wsp:Policy><wsdl:input message="p1:p2.Employment_Create_InputMessage"/><wsdl:output message="p1:p2.Employment_Create_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="CreateBinding" type="p1:Create"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Create"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Create"><wsdl:port binding="p1:CreateBinding" name="Create"><soap:address location="http://www.example.org/"/></wsdl:port></wsdl:service></wsdl:definitions>